###################################################################

# Created by write_sdc on Thu Apr  6 23:34:23 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 0
create_clock -name vclk  -period 0.25  -waveform {0 0.125}
set_input_delay -clock vclk  0  [get_ports {codeword_in[79]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[78]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[77]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[76]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[75]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[74]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[73]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[72]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[71]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[70]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[69]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[68]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[67]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[66]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[65]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[64]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[63]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[62]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[61]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[60]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[59]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[58]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[57]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[56]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[55]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[54]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[53]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[52]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[51]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[50]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[49]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[48]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[47]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[46]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[45]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[44]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[43]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[42]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[41]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[40]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[39]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[38]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[37]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[36]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[35]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[34]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[33]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[32]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[31]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[30]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[29]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[28]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[27]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[26]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[25]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[24]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[23]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[22]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[21]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[20]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[19]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[18]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[17]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[16]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[15]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[14]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[13]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[12]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[11]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[10]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[9]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[8]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[7]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[6]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[5]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[4]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[3]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[2]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[1]}]
set_input_delay -clock vclk  0  [get_ports {codeword_in[0]}]
set_output_delay -clock vclk  0  [get_ports {syndrome_out[15]}]
set_output_delay -clock vclk  0  [get_ports {syndrome_out[14]}]
set_output_delay -clock vclk  0  [get_ports {syndrome_out[13]}]
set_output_delay -clock vclk  0  [get_ports {syndrome_out[12]}]
set_output_delay -clock vclk  0  [get_ports {syndrome_out[11]}]
set_output_delay -clock vclk  0  [get_ports {syndrome_out[10]}]
set_output_delay -clock vclk  0  [get_ports {syndrome_out[9]}]
set_output_delay -clock vclk  0  [get_ports {syndrome_out[8]}]
set_output_delay -clock vclk  0  [get_ports {syndrome_out[7]}]
set_output_delay -clock vclk  0  [get_ports {syndrome_out[6]}]
set_output_delay -clock vclk  0  [get_ports {syndrome_out[5]}]
set_output_delay -clock vclk  0  [get_ports {syndrome_out[4]}]
set_output_delay -clock vclk  0  [get_ports {syndrome_out[3]}]
set_output_delay -clock vclk  0  [get_ports {syndrome_out[2]}]
set_output_delay -clock vclk  0  [get_ports {syndrome_out[1]}]
set_output_delay -clock vclk  0  [get_ports {syndrome_out[0]}]
set_output_delay -clock vclk  0  [get_ports error_flag_out]
set_input_transition -max 0.1  [get_ports {codeword_in[79]}]
set_input_transition -min 0.1  [get_ports {codeword_in[79]}]
set_input_transition -max 0.1  [get_ports {codeword_in[78]}]
set_input_transition -min 0.1  [get_ports {codeword_in[78]}]
set_input_transition -max 0.1  [get_ports {codeword_in[77]}]
set_input_transition -min 0.1  [get_ports {codeword_in[77]}]
set_input_transition -max 0.1  [get_ports {codeword_in[76]}]
set_input_transition -min 0.1  [get_ports {codeword_in[76]}]
set_input_transition -max 0.1  [get_ports {codeword_in[75]}]
set_input_transition -min 0.1  [get_ports {codeword_in[75]}]
set_input_transition -max 0.1  [get_ports {codeword_in[74]}]
set_input_transition -min 0.1  [get_ports {codeword_in[74]}]
set_input_transition -max 0.1  [get_ports {codeword_in[73]}]
set_input_transition -min 0.1  [get_ports {codeword_in[73]}]
set_input_transition -max 0.1  [get_ports {codeword_in[72]}]
set_input_transition -min 0.1  [get_ports {codeword_in[72]}]
set_input_transition -max 0.1  [get_ports {codeword_in[71]}]
set_input_transition -min 0.1  [get_ports {codeword_in[71]}]
set_input_transition -max 0.1  [get_ports {codeword_in[70]}]
set_input_transition -min 0.1  [get_ports {codeword_in[70]}]
set_input_transition -max 0.1  [get_ports {codeword_in[69]}]
set_input_transition -min 0.1  [get_ports {codeword_in[69]}]
set_input_transition -max 0.1  [get_ports {codeword_in[68]}]
set_input_transition -min 0.1  [get_ports {codeword_in[68]}]
set_input_transition -max 0.1  [get_ports {codeword_in[67]}]
set_input_transition -min 0.1  [get_ports {codeword_in[67]}]
set_input_transition -max 0.1  [get_ports {codeword_in[66]}]
set_input_transition -min 0.1  [get_ports {codeword_in[66]}]
set_input_transition -max 0.1  [get_ports {codeword_in[65]}]
set_input_transition -min 0.1  [get_ports {codeword_in[65]}]
set_input_transition -max 0.1  [get_ports {codeword_in[64]}]
set_input_transition -min 0.1  [get_ports {codeword_in[64]}]
set_input_transition -max 0.1  [get_ports {codeword_in[63]}]
set_input_transition -min 0.1  [get_ports {codeword_in[63]}]
set_input_transition -max 0.1  [get_ports {codeword_in[62]}]
set_input_transition -min 0.1  [get_ports {codeword_in[62]}]
set_input_transition -max 0.1  [get_ports {codeword_in[61]}]
set_input_transition -min 0.1  [get_ports {codeword_in[61]}]
set_input_transition -max 0.1  [get_ports {codeword_in[60]}]
set_input_transition -min 0.1  [get_ports {codeword_in[60]}]
set_input_transition -max 0.1  [get_ports {codeword_in[59]}]
set_input_transition -min 0.1  [get_ports {codeword_in[59]}]
set_input_transition -max 0.1  [get_ports {codeword_in[58]}]
set_input_transition -min 0.1  [get_ports {codeword_in[58]}]
set_input_transition -max 0.1  [get_ports {codeword_in[57]}]
set_input_transition -min 0.1  [get_ports {codeword_in[57]}]
set_input_transition -max 0.1  [get_ports {codeword_in[56]}]
set_input_transition -min 0.1  [get_ports {codeword_in[56]}]
set_input_transition -max 0.1  [get_ports {codeword_in[55]}]
set_input_transition -min 0.1  [get_ports {codeword_in[55]}]
set_input_transition -max 0.1  [get_ports {codeword_in[54]}]
set_input_transition -min 0.1  [get_ports {codeword_in[54]}]
set_input_transition -max 0.1  [get_ports {codeword_in[53]}]
set_input_transition -min 0.1  [get_ports {codeword_in[53]}]
set_input_transition -max 0.1  [get_ports {codeword_in[52]}]
set_input_transition -min 0.1  [get_ports {codeword_in[52]}]
set_input_transition -max 0.1  [get_ports {codeword_in[51]}]
set_input_transition -min 0.1  [get_ports {codeword_in[51]}]
set_input_transition -max 0.1  [get_ports {codeword_in[50]}]
set_input_transition -min 0.1  [get_ports {codeword_in[50]}]
set_input_transition -max 0.1  [get_ports {codeword_in[49]}]
set_input_transition -min 0.1  [get_ports {codeword_in[49]}]
set_input_transition -max 0.1  [get_ports {codeword_in[48]}]
set_input_transition -min 0.1  [get_ports {codeword_in[48]}]
set_input_transition -max 0.1  [get_ports {codeword_in[47]}]
set_input_transition -min 0.1  [get_ports {codeword_in[47]}]
set_input_transition -max 0.1  [get_ports {codeword_in[46]}]
set_input_transition -min 0.1  [get_ports {codeword_in[46]}]
set_input_transition -max 0.1  [get_ports {codeword_in[45]}]
set_input_transition -min 0.1  [get_ports {codeword_in[45]}]
set_input_transition -max 0.1  [get_ports {codeword_in[44]}]
set_input_transition -min 0.1  [get_ports {codeword_in[44]}]
set_input_transition -max 0.1  [get_ports {codeword_in[43]}]
set_input_transition -min 0.1  [get_ports {codeword_in[43]}]
set_input_transition -max 0.1  [get_ports {codeword_in[42]}]
set_input_transition -min 0.1  [get_ports {codeword_in[42]}]
set_input_transition -max 0.1  [get_ports {codeword_in[41]}]
set_input_transition -min 0.1  [get_ports {codeword_in[41]}]
set_input_transition -max 0.1  [get_ports {codeword_in[40]}]
set_input_transition -min 0.1  [get_ports {codeword_in[40]}]
set_input_transition -max 0.1  [get_ports {codeword_in[39]}]
set_input_transition -min 0.1  [get_ports {codeword_in[39]}]
set_input_transition -max 0.1  [get_ports {codeword_in[38]}]
set_input_transition -min 0.1  [get_ports {codeword_in[38]}]
set_input_transition -max 0.1  [get_ports {codeword_in[37]}]
set_input_transition -min 0.1  [get_ports {codeword_in[37]}]
set_input_transition -max 0.1  [get_ports {codeword_in[36]}]
set_input_transition -min 0.1  [get_ports {codeword_in[36]}]
set_input_transition -max 0.1  [get_ports {codeword_in[35]}]
set_input_transition -min 0.1  [get_ports {codeword_in[35]}]
set_input_transition -max 0.1  [get_ports {codeword_in[34]}]
set_input_transition -min 0.1  [get_ports {codeword_in[34]}]
set_input_transition -max 0.1  [get_ports {codeword_in[33]}]
set_input_transition -min 0.1  [get_ports {codeword_in[33]}]
set_input_transition -max 0.1  [get_ports {codeword_in[32]}]
set_input_transition -min 0.1  [get_ports {codeword_in[32]}]
set_input_transition -max 0.1  [get_ports {codeword_in[31]}]
set_input_transition -min 0.1  [get_ports {codeword_in[31]}]
set_input_transition -max 0.1  [get_ports {codeword_in[30]}]
set_input_transition -min 0.1  [get_ports {codeword_in[30]}]
set_input_transition -max 0.1  [get_ports {codeword_in[29]}]
set_input_transition -min 0.1  [get_ports {codeword_in[29]}]
set_input_transition -max 0.1  [get_ports {codeword_in[28]}]
set_input_transition -min 0.1  [get_ports {codeword_in[28]}]
set_input_transition -max 0.1  [get_ports {codeword_in[27]}]
set_input_transition -min 0.1  [get_ports {codeword_in[27]}]
set_input_transition -max 0.1  [get_ports {codeword_in[26]}]
set_input_transition -min 0.1  [get_ports {codeword_in[26]}]
set_input_transition -max 0.1  [get_ports {codeword_in[25]}]
set_input_transition -min 0.1  [get_ports {codeword_in[25]}]
set_input_transition -max 0.1  [get_ports {codeword_in[24]}]
set_input_transition -min 0.1  [get_ports {codeword_in[24]}]
set_input_transition -max 0.1  [get_ports {codeword_in[23]}]
set_input_transition -min 0.1  [get_ports {codeword_in[23]}]
set_input_transition -max 0.1  [get_ports {codeword_in[22]}]
set_input_transition -min 0.1  [get_ports {codeword_in[22]}]
set_input_transition -max 0.1  [get_ports {codeword_in[21]}]
set_input_transition -min 0.1  [get_ports {codeword_in[21]}]
set_input_transition -max 0.1  [get_ports {codeword_in[20]}]
set_input_transition -min 0.1  [get_ports {codeword_in[20]}]
set_input_transition -max 0.1  [get_ports {codeword_in[19]}]
set_input_transition -min 0.1  [get_ports {codeword_in[19]}]
set_input_transition -max 0.1  [get_ports {codeword_in[18]}]
set_input_transition -min 0.1  [get_ports {codeword_in[18]}]
set_input_transition -max 0.1  [get_ports {codeword_in[17]}]
set_input_transition -min 0.1  [get_ports {codeword_in[17]}]
set_input_transition -max 0.1  [get_ports {codeword_in[16]}]
set_input_transition -min 0.1  [get_ports {codeword_in[16]}]
set_input_transition -max 0.1  [get_ports {codeword_in[15]}]
set_input_transition -min 0.1  [get_ports {codeword_in[15]}]
set_input_transition -max 0.1  [get_ports {codeword_in[14]}]
set_input_transition -min 0.1  [get_ports {codeword_in[14]}]
set_input_transition -max 0.1  [get_ports {codeword_in[13]}]
set_input_transition -min 0.1  [get_ports {codeword_in[13]}]
set_input_transition -max 0.1  [get_ports {codeword_in[12]}]
set_input_transition -min 0.1  [get_ports {codeword_in[12]}]
set_input_transition -max 0.1  [get_ports {codeword_in[11]}]
set_input_transition -min 0.1  [get_ports {codeword_in[11]}]
set_input_transition -max 0.1  [get_ports {codeword_in[10]}]
set_input_transition -min 0.1  [get_ports {codeword_in[10]}]
set_input_transition -max 0.1  [get_ports {codeword_in[9]}]
set_input_transition -min 0.1  [get_ports {codeword_in[9]}]
set_input_transition -max 0.1  [get_ports {codeword_in[8]}]
set_input_transition -min 0.1  [get_ports {codeword_in[8]}]
set_input_transition -max 0.1  [get_ports {codeword_in[7]}]
set_input_transition -min 0.1  [get_ports {codeword_in[7]}]
set_input_transition -max 0.1  [get_ports {codeword_in[6]}]
set_input_transition -min 0.1  [get_ports {codeword_in[6]}]
set_input_transition -max 0.1  [get_ports {codeword_in[5]}]
set_input_transition -min 0.1  [get_ports {codeword_in[5]}]
set_input_transition -max 0.1  [get_ports {codeword_in[4]}]
set_input_transition -min 0.1  [get_ports {codeword_in[4]}]
set_input_transition -max 0.1  [get_ports {codeword_in[3]}]
set_input_transition -min 0.1  [get_ports {codeword_in[3]}]
set_input_transition -max 0.1  [get_ports {codeword_in[2]}]
set_input_transition -min 0.1  [get_ports {codeword_in[2]}]
set_input_transition -max 0.1  [get_ports {codeword_in[1]}]
set_input_transition -min 0.1  [get_ports {codeword_in[1]}]
set_input_transition -max 0.1  [get_ports {codeword_in[0]}]
set_input_transition -min 0.1  [get_ports {codeword_in[0]}]
